
//Copyright (C) 1998-2010 MKTMK Moscow, Russia
//e-mail: mktmk<at>narod.ru
//interpreter Open Basic (OB).

//you may use Open Basic for:
// - script language expandable by user without compilation need
// - configuration file language
// - input language for terminal program (batch file is obtained automatically)

//features:
// - Open Basic (OB) is fully interpreter
// - OB have Basic input language, expandable by user
// - OB is a C++ class with member-function (load, run etc.)
// - OB designed for embed to user application
// - OB distributed as a library or source
// - OB support float, integer and string variable and array of this type
// - OB written entirely in ANSI C++ without any compiler extention
// - OB is OS independent (do not use any OS API)
// - OB do not use any graphic libraries
// - OB do not use any third-party virtual machine
// - OB use standart C++ header file and streams
// - OB use exception for error handling (for eliminate memory leak)
// - OB use template and virtual function
// - OB have multithread-safe code
// - user may connect user function with OB execution system
// - do not need SWIG for connect user function with OB execution system
// - user function may be C/C++, ASM and other language
// - user function may be connect during run-time
// - user function may be call from Basic program as Basic function
// - user function may receive data from Basic program
// - user function may return data to Basic program

// - x86.exe code size of OB less then 100K if other libraries is dynamic link

#ifndef OB_THIS
#define OB_THIS

//for version 1.80
//if you build Unicode version library
//you must define OB_WCHAR for use Unicode input file

//common includes
#ifdef _MSC_VER

//MSVC7

#include <sstream>
#include <iostream>
#include <fstream>
#include <math.h>
#include <stdlib.h>
#include <ctype.h>
#include <limits.h>
#include <time.h>

#else

//BCB60

#ifdef _BORLAND_

#include <sstream>
#include <iostream.h>
#include <fstream.h>
#include <math.h>
#include <stdlib.h>
#include <ctype.h>
#include <limits.h>
#include <time.h>

#else

//GCC 3.2.2

#include <sstream>
#include <iostream>
#include <fstream>
#include <math.h>
#include <stdlib.h>
#include <ctype.h>
#include <limits>
#include <time.h>

#endif
#endif

using namespace std;

#ifdef OB_WCHAR
namespace ob_wcharspace{
#else
namespace ob_charspace{
#endif

#ifndef OB_WCHAR

typedef stringstream   ob_strstream;//common ptr for conversion wchar->char stream
typedef ostringstream  ob_ostrstream;//for conversion digit->string
typedef istringstream  ob_istrstream;//for conversion string->digit
typedef string         ob_standartstring;//for create temporary string object

typedef stringstream   ob_shortstrstream;//for datastream

typedef istream        ob_istreamcommon;//for common pointer
typedef ostream        ob_ostreamcommon;//for common pointer
typedef fstream        ob_fstream;//for file structure
typedef ifstream       ob_ifstream;//for DLL
typedef ofstream       ob_ofstream;//for DLL

#else

typedef wstringstream  ob_strstream;
typedef wostringstream ob_ostrstream;
typedef wistringstream ob_istrstream;
typedef wstring        ob_standartstring;

typedef stringstream   ob_shortstrstream;

typedef istream        ob_istreamcommon;
typedef ostream        ob_ostreamcommon;
typedef fstream        ob_fstream;
typedef ifstream       ob_ifstream;
typedef ofstream       ob_ofstream;

#endif

//compilers condition
#ifdef __BORLANDC__
#define MSTORE_INLINE
#define MVECT_INLINE
#define MLIST_INLINE
#define MSTACK_INLINE
#define MHASH_INLINE
#define OB_INLINE
#endif

//containers for ob
#include "mstore.h"
#include "mvect.h"
#include "mlist.h"
#include "mstack.h"
#include "mhash.h"

//define
#ifndef OB_INLINE
#define OB_INLINE inline
#endif

#ifndef OB_NULL
#define OB_NULL (0)
#endif

//forward declarations
class ob_obasic;
class ob_par;
class ob_var;
class ob_int;
class ob_float;

class ob_str;

//types of Open Basic
//service types
typedef unsigned int      ob_type_arraydimension;       //1
typedef unsigned int      ob_type_arraysize;            //2
typedef streampos         ob_type_streampos;            //3
typedef unsigned int      ob_type_parnum;               //4
typedef unsigned int      ob_type_filenum;              //5
typedef unsigned char     ob_type_hashtablelength;      //6
typedef size_t            ob_type_stringsize;           //7
typedef unsigned int      ob_type_codeerror;            //8
typedef unsigned long int ob_type_serialnum;            //9
typedef unsigned int      ob_type_version;              //10
typedef unsigned int      ob_type_countlist;            //11

//variable types
#ifndef OB_WCHAR
typedef          char     ob_type_char;                 //12
#else
typedef          wchar_t  ob_type_char;                 //12
#endif

typedef float             ob_type_flo;                  //13
typedef int               ob_type_int;                  //14 

//service types
typedef unsigned int      ob_type_statictablesize;      //15
typedef unsigned int      ob_type_countnestedoperator;  //16
typedef unsigned int      ob_type_srandargument;        //17

typedef          char     ob_type_small_char;           //18
typedef          wchar_t  ob_type_wide_char;            //19

typedef size_t            ob_type_data_operator_length; //20
typedef unsigned int      ob_type_num_previous_eol_ptr; //21

typedef mstore_dynamicalloc<ob_type_char,ob_type_stringsize> ob_type_d;
typedef mvect_common<ob_type_d>                              ob_type_s;

typedef mstore_staticdatawithoutbuf<ob_type_char,ob_type_stringsize> ob_type_d1;
typedef mvect_common<ob_type_d1>                                     ob_type_s1;

typedef mstore_dynamicalloc<ob_type_arraysize,ob_type_arraydimension> ob_type_a;
typedef mvect_common<ob_type_a>                                     ob_type_dim;

typedef mstore_dynamicalloc<ob_type_small_char,ob_type_stringsize> ob_type_f;
typedef mvect_common<ob_type_f>                         ob_type_name_char_small;

typedef ob_type_name_char_small ob_type_string_char_small;

//const of Open Basic
//max length string in input operator
const ob_type_stringsize      ob_maxlengthstring=4096;
const ob_type_stringsize      ob_maxlengthstring_for_convert=200;
const ob_type_parnum          ob_maxnumpar=64;
