/// \~english
/// \mainpage XY Plot library v 4.0.1
///  \tableofcontents
///  Добро пожаловать в библеотеку XYPlot.
///  \section sec Возможности библеотеки. 
///  Библеотека XYPlot позволяет ... 
///		\li \ref subMain001 
///		\li \ref subMain002.
///		\li \ref subMain003.
///  Для дополнительной информации перейдите на  \ref page2.
///  \subsection subMain001 Установка
///  Установка библеотеки ... .
///  \subsection subMain002 Описание библеотеки
///  Текст об описании.
///  \subsection subMain003 Инициализация
///  Текст об инициализации.
///  \subsection subMain004 Настройка элементов 
///  Текст об настройке элементов.
///  \subsection subMain005 Отображение
///  Текст об Отображении.


///  \page page1 Что нового?
///  \tableofcontents
///  \section secVersions Список изменений по версиям.
///  \subsection subsecV441 XY Plot v 4.4.1 
///  \subsubsection ssubV241Changes Изменено
///  \li Измененение 001 
///  \li Измененение 002 
///  \li Измененение 003 
///  \li Измененение 004 
///  \subsubsection ssubV441Add		Добавлено
///  \li Добавление 001 
///  \li Добавление 002 
///  \li Добавление 003 
///  \li Добавление 004 
///  \subsubsection ssubV441Fixed  Исправлено
///  \li Исправление 001 
///  \li Исправление 002 
///  \li Исправление 003 
///  \li Исправление 004 
///  \subsection subsecV341 XY Plot v 3.4.1 
///  \subsubsection ssubV341Changes Изменено
///  \li Измененение 001 
///  \li Измененение 002 
///  \li Измененение 003 
///  \li Измененение 004 
///  \subsubsection ssubV341Add		Добавлено
///  \li Добавление 001 
///  \li Добавление 002 
///  \li Добавление 003 
///  \li Добавление 004 
///  \subsubsection ssubV341Fixed  Исправлено
///  \li Исправление 001 
///  \li Исправление 002 
///  \li Исправление 003 
///  \li Исправление 004 
///  \subsection subsecV231 XY Plot v 2.3.1 
///  \subsubsection ssubV231Changes Изменено
///  \li Измененение 001 
///  \li Измененение 002 
///  \li Измененение 003 
///  \li Измененение 004 
///  \subsubsection ssubV231Add		Добавлено
///  \li Добавление 001 
///  \li Добавление 002 
///  \li Добавление 003 
///  \li Добавление 004 
///  \subsubsection ssubV231Fixed  Исправлено
///  \li Исправление 001 
///  \li Исправление 002 
///  \li Исправление 003 
///  \li Исправление 004 
///  \subsection subsecV221 XY Plot v 2.2.1 
///  \subsubsection ssubV101Changes Изменено
///  \li Измененение 001 
///  \li Измененение 002 
///  \li Измененение 003 
///  \li Измененение 004 
///  \subsubsection ssubV221Add		Добавлено
///  \li Добавление 001 
///  \li Добавление 002 
///  \li Добавление 003 
///  \li Добавление 004 
///  \subsubsection ssubV221Fixed  Исправлено
///  \li Исправление 001 
///  \li Исправление 002 
///  \li Исправление 003 
///  \li Исправление 004 
///  \subsection subsecV211 XY Plot v 2.1.1 
///  \subsubsection ssubV211Changes Изменено
///  \li Измененение 001 
///  \li Измененение 002 
///  \li Измененение 003 
///  \li Измененение 004 
///  \subsubsection ssubV211Add		Добавлено
///  \li Добавление 001 
///  \li Добавление 002 
///  \li Добавление 003 
///  \li Добавление 004 
///  \subsubsection ssubV211Fixed  Исправлено
///  \li Исправление 001 
///  \li Исправление 002 
///  \li Исправление 003 
///  \li Исправление 004 
///  \subsection subsecV101 XY Plot v 1.0.1 
///  \subsubsection ssubV101Changes Изменено
///  \li Измененение 001 
///  \li Измененение 002 
///  \li Измененение 003 
///  \li Измененение 004 
///  \subsubsection ssubV101Add		Добавлено
///  \li Добавление 001 
///  \li Добавление 002 
///  \li Добавление 003 
///  \li Добавление 004 
///  \subsubsection ssubV101Fixed  Исправлено
///  \li Исправление 001 
///  \li Исправление 002 
///  \li Исправление 003 
///  \li Исправление 004 



///  \page page2 Страница 1
///  \tableofcontents
///  Текст в начале страницы.
///  \section sec Это пример секции. 
///  Эта страница содержит подсекции \ref p02subsec01 and \ref p02subsec02.
///  Для дополнительной информации перейдите на  \ref page2.
///  \subsection p02subsec01 Раздел 1
///  Это текст первой подсекции страницы 2.
///  \subsection p02subsec02 Раздел 2
///  Это текст второй подсекции страницы 2.
///  Это текст второй подсекции страницы 2.

///  \page page3 Страница 3
///  \tableofcontents
///  Текст в начале страницы.
///  \section sec Это пример секции. 
///  Эта страница содержит подсекции \ref p03subsec01 and \ref p03subsec02.
///  Для дополнительной информации перейдите на страницу 1 \ref page1.
///  \subsection p03subsec01 Раздел 2
///  Это текст первой подсекции страницы 3.
///  \subsection p03subsec02 Раздел 2
///  Это текст второй подсекции страницы 3.
///  Это текст второй подсекции страницы 3.
///	\f[\sqrt {{b^2} - 4ac}\f]
///\f[\left( {\matrix{
///		{{a_{11}}} & {{a_{12}}} & {{a_{13}}}  \cr 
///		{{a_{21}}} & {{a_{22}}} & {{a_{23}}}  \cr 
///		{{a_{31}}} & {{a_{32}}} & {{a_{33}}}  \cr 
///} } \right)\f]
///	\f[\sum\limits_{i = 1}^n {X_i^2}  = \mathop{\int\!\!\!\int\!\!\!\int}\limits_{\kern-5.5pt 0} 
///{{{dy} \over {dx}}{{ - b \pm \sqrt {{b^2} - 4ac} } \over {2a}}} \f]

/// \example ex_001.cpp	Пример создания экземпляра графика.

/// \example ex_002.cpp Пример создания профиля.

/// \example ex_003.cpp Пример задания данных профиля.
/// \example ex_004.cpp Пример задания данных профиля.